tutorials/shockTube/shockTubeIncredibleSolver/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
100
(
1557.99
1557.99
1557.99
1557.99
1557.99
1557.99
1557.99
1557.99
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1557.99;
    }
    outlet
    {
        type            calculated;
        value           uniform 519.33;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
