tutorials/shockTube/shockTubeIncredibleSolver/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hePsiThermo<pureMixture<const<hConst<perfectGas<specie>>,sensibleInternalEnergy>>>;

// name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.9 1007 0 0 0.7;
// adapting : mixture         air 1 11640.2561438975 2.5 0 0 0.7;
mixture //air
{
  specie
    {
      nMoles    1;
      molWeight 11640.2561438975;
    }
  thermodynamics
    {
      Cp    2.5;
      Hf    0;
    }
  transport
    {
      mu    0;
      Pr    0.7;
    }
}
// ************************************************************************* //
